In [2]:
import sqlite3
import pandas as pd

In [3]:
dir_db = "sql-murder-mystery.db"

conn = sqlite3.connect(dir_db)

In [4]:
# Creamos el cursor
cursor = conn.cursor()

In [5]:
query = """
SELECT description
FROM crime_scene_report
WHERE date = "20180115" and type = "murder" and city = "SQL City"
"""

mi_query = cursor.execute(query)
mi_query.fetchall()

[('Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".',)]

In [11]:
query = """
SELECT p.name, p.address_number, p.address_street_name, p.ssn
FROM person p
WHERE p.address_street_name = 'Northwestern Dr'
ORDER BY address_number DESC
LIMIT 1
"""

mi_def = pd.read_sql_query(query, conn)
mi_def

             name  address_number address_street_name        ssn
0  Morty Schapiro            4919     Northwestern Dr  111564949

In [7]:
query = """
SELECT p.name, p.address_number, p.address_street_name, p.ssn
FROM person p
WHERE p.address_street_name = 'Franklin Ave'
ORDER BY name
LIMIT 2
"""

mi_def = pd.read_sql_query(query, conn)
mi_def

             name  address_number address_street_name        ssn
0    Amado Mattan              99        Franklin Ave  125205748
1  Annabel Miller             103        Franklin Ave  318771143

In [12]:
query = """
SELECT *
FROM income i
WHERE i.ssn = 111564949
"""

mi_def = pd.read_sql_query(query, conn)
mi_def

Empty DataFrame
Columns: [ssn, annual_income]
Index: []

In [20]:
query = """
SELECT i.transcript, p.name
FROM interview i
JOIN person p ON p.id = i.person_id
WHERE p.name = "Annabel Miller"
"""

mi_query = cursor.execute(query)
mi_query.fetchall()

[('I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.',
  'Annabel Miller')]

In [21]:
query = """
SELECT i.transcript, p.name
FROM interview i
JOIN person p ON p.id = i.person_id
WHERE p.name = "Morty Schapiro"
"""

mi_query = cursor.execute(query)
mi_query.fetchall()

[('I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".',
  'Morty Schapiro')]

In [24]:
query = """
SELECT *
FROM get_fit_now_member gf
WHERE gf.membership_status = "gold" and gf.id LIKE "48Z%" 
"""

mi_def = pd.read_sql_query(query, conn)
mi_def

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [28]:
query = """
SELECT *
FROM person p
JOIN drivers_license dl ON p.license_id = dl.id
WHERE p.name = "Jeremy Bowers"
"""

mi_def = pd.read_sql_query(query, conn)
mi_def

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

In [33]:
query = """
SELECT *
FROM get_fit_now_check_in gfc
WHERE gfC.membership_id LIKE "48Z%" and gfc.check_in_date LIKE "20180109"
"""

mi_def = pd.read_sql_query(query, conn)
mi_def

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700